#+title: Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

** Archives and loadings
#+begin_src emacs-lisp

  ; archives
  (require 'package)
  (setq package-archives '(("gnu"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
                            ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))
  (package-initialize)

  ; refresh empty archives
  (unless package-archive-contents
    (package-refresh-contents))

  ; install use-package if it hasn't be installed
  (unless (package-installed-p 'usepackage)
    (package-install 'use-package))
  (require 'use-package)

  ; default to set :ensure t for all packages
  (setq use-package-always-ensure t)  
  (add-to-list 'load-path (expand-file-name "~/.emacs.d/lisp"))
#+end_src

#+RESULTS:
| d:/Emacs/.emacs.d/lisp | d:/Emacs/.emacs.d/elpa/use-package-20221012.1743 | d:/Emacs/.emacs.d/elpa/bind-key-20220910.2157 | d:/Emacs/share/emacs/28.1/site-lisp | d:/Emacs/share/emacs/site-lisp | d:/Emacs/share/emacs/28.1/lisp | d:/Emacs/share/emacs/28.1/lisp/vc | d:/Emacs/share/emacs/28.1/lisp/url | d:/Emacs/share/emacs/28.1/lisp/textmodes | d:/Emacs/share/emacs/28.1/lisp/progmodes | d:/Emacs/share/emacs/28.1/lisp/play | d:/Emacs/share/emacs/28.1/lisp/org | d:/Emacs/share/emacs/28.1/lisp/nxml | d:/Emacs/share/emacs/28.1/lisp/net | d:/Emacs/share/emacs/28.1/lisp/mh-e | d:/Emacs/share/emacs/28.1/lisp/mail | d:/Emacs/share/emacs/28.1/lisp/leim | d:/Emacs/share/emacs/28.1/lisp/language | d:/Emacs/share/emacs/28.1/lisp/international | d:/Emacs/share/emacs/28.1/lisp/image | d:/Emacs/share/emacs/28.1/lisp/gnus | d:/Emacs/share/emacs/28.1/lisp/eshell | d:/Emacs/share/emacs/28.1/lisp/erc | d:/Emacs/share/emacs/28.1/lisp/emulation | d:/Emacs/share/emacs/28.1/lisp/emacs-lisp | d:/Emacs/share/emacs/28.1/lisp/cedet | d:/Emacs/share/emacs/28.1/lisp/calendar | d:/Emacs/share/emacs/28.1/lisp/calc | d:/Emacs/share/emacs/28.1/lisp/obsolete |

** Faces
#+begin_src emacs-lisp
  (defun yc/org-mode-setup ()
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (add-hook 'org-mode-hook #'yc/org-mode-setup)
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-ellipsis " ▾")
  (setq org-habit-graph-column 60)

  (use-package org-bullets

    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

#+RESULTS:
| org-bullets-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | yc/org-mode-setup |

** Org-babel

#+begin_src emacs-lisp

  ; add emacs-lisp and python
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))
  (setq org-confirm-babel-evaluate nil)


  ; set templates
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src

#+RESULTS:
: ((py . src python) (el . src emacs-lisp) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

